Revit 2024 API
ParameterTypeId.WallTopIsAttached Property
 "Top is Attached"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId WallTopIsAttached { get; }
Visual Basic
Public Shared ReadOnly Property WallTopIsAttached As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ WallTopIsAttached {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace